In [1]:
import sys
sys.path.append('..')
from anonymize.suppress import *

In [2]:
# Example dataframe
df = pd.DataFrame({
    'hour': [8, 14, 15, 20, 23],
    'object': ['person', 'person', 'cat', 'dog', 'crow'],
    'age': [20, 55, 3, 5, 1]
})

In [3]:
df

   hour  object  age
0     8  person   20
1    14  person   55
2    15     cat    3
3    20     dog    5
4    23    crow    1

In [4]:
suppress_categorical(df, 'cat', 1)

[]

In [5]:
df

   hour                    object  age
0     8                    person   20
1    14                    person   55
2    15  (crow, cat, person, dog)    3
3    20                       dog    5
4    23                      crow    1

In [6]:
suppress_categorical(df, 'person', 1)

[frozenset({'crow', 'cat', 'person', 'dog'})]

In [7]:
df

   hour                    object  age
0     8  (crow, cat, person, dog)   20
1    14  (crow, cat, person, dog)   55
2    15  (crow, cat, person, dog)    3
3    20                       dog    5
4    23                      crow    1